app/controllers/comandas_controller.rb

SELECT `comanda`.* FROM `comanda`
---
  def index
    @comandas = Comanda.all

INSERT INTO `comanda` (`idcomanda`, `idFuncionario`, `mesa`, `valorFinal`, `dataAbertura`, `dataEncerramento`) VALUES (1, 1, 1, 1000.0, '2015-11-06 03:20:00', '2015-11-06 03:20:00')
---
  def create
    @comanda = Comanda.new
    @comanda.idFuncionario = current_funcionario.id
    @comanda.mesa = params[:comanda][:mesa]
    @comanda.dataAbertura = Time.now.strftime("%Y-%m-%d %H:%M:%S")

    respond_to do |format|
      if @comanda.save