app/controllers/componentes_produtos_controller.rb

SELECT `componentes_produto`.* FROM `componentes_produto`
---
  def index
    @componentes_produtos = ComponentesProduto.all