app/controllers/fornecedors_controller.rb

  def index
    @fornecedors = Fornecedor.all
---
SELECT `fornecedor`.* FROM `fornecedor`