app/controllers/funcionarios_controller.rb

  def index
    @funcionarios = Funcionario.all
---
SELECT `funcionario`.* FROM `funcionario`

  def create
    @funcionario = Funcionario.new(funcionario_params)

    respond_to do |format|
      if @funcionario.save
---
INSERT INTO `funcionario` (`nome`, `cpf`, `cidade`, `estado`, `num`, `endereco`, `telefone`, `salario`, `ativo`, `turno`, `login`, `password_digest`, `nivelAcesso`, `dataContratacao`) VALUES ('Florêncio Natan dos Santos Gama', '00000000000', 'Nossa senhora do socorro', 'Sergipe', '10', 'Minha casa', '0000000', 788.0, 1, 1, 'florencio', '$2a$10$gpaGmhVAlh0Xyl6k/NDCluLDPIm5vogkOEguFiBAeOKJBclXqnkzK', 1, '2010-01-03')

  def update
    respond_to do |format|
      if @funcionario.update(funcionario_params)
---
UPDATE `funcionario` SET `password_digest` = '$2a$10$9SOovishQCDsLH2o.WTRj.nkiCVs6Yl0D7jDRJoHs/.yIXy101k.2' WHERE `funcionario`.`idFuncionario` = 1

    def set_funcionario
      @funcionario = Funcionario.find(params[:id])
---
SELECT  `funcionario`.* FROM `funcionario` WHERE `funcionario`.`id` = 1 LIMIT 1