app/controllers/items_controller.rb

SELECT `item`.* FROM `item`
---
  def index
    @items = Item.all