app/controllers/pedidos_controller.rb

SELECT `pedido`.* FROM `pedido`
---
  def index
    @pedidos = Pedido.all