app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all.order :nome
---
SELECT `produto`.* FROM `produto`