app/controllers/sessions_controller.rb

SELECT  `funcionario`.* FROM `funcionario` WHERE `funcionario`.`login` = 'Florencio' LIMIT 1
---
  def create
    func = Funcionario.find_by(login: params[:session][:login])