app/controllers/vendes_controller.rb

  def index
    @vendes = Vende.all
---
SELECT `vende`.* FROM `vende`